---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeReferenceOptions.GetExternalGeometryId
source: html/89e9092c-025e-4a51-d82d-bf2ff385a523.htm
---
# Autodesk.Revit.DB.DirectShapeReferenceOptions.GetExternalGeometryId Method

Retrieves the ExternalGeometryId associated with the reference object.

## Syntax (C#)
```csharp
public ExternalGeometryId GetExternalGeometryId()
```

## Remarks
If an ExternalGeometryId has not been set, this method returns Nothing nullptr a null reference ( Nothing in Visual Basic) .